The structural component that the hanger is attached to has changed to a different element.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FabricationRodsConnectionChangedWarning { get; }
  Visual Basic
Public Shared ReadOnly Property FabricationRodsConnectionChangedWarning As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FabricationRodsConnectionChangedWarning {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPFabricationFailures Class
  Autodesk.Revit.DB Namespace